#+ORG2BLOG:
#+DATE: [2020-07-06 Mon 13:11]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: JavaScript
#+TAGS:JavaScipt,ES6,CommonJS,AMD,CMD
#+DESCRIPTION:
#+TITLE: JavaScript
*** Object
    assign函数复制对象
    #+BEGIN_SRC js
      const target={a:1,b:2};
      const source={b:4,c:5};

      const returnedTarget=Object.assign(target,source);
      target.a=5;
      console.log(target);

      console.log(returnedTarget);
    #+END_SRC

    #+RESULTS:
    : { a: 5, b: 4, c: 5 }
    : { a: 5, b: 4, c: 5 }
    : undefined
    
    拷贝访问器
    #+BEGIN_SRC js
      const obj={
	  foo:1,
	  get bar(){
	      return 2;
	  }
      };

      let copy=Object.assign({},obj);
      console.log(copy);

      function completeAssign(target, ...sources){
	  sources.forEach(source=>{
	      let descriptors=Object.keys(source).reduce((descriptors,key)=>{
		  descriptors[key]=Object.getOwnPropertyDescriptor(source,key);
		  return descriptors;
	      },{});

	      Object.getOwnPropertySymbols(source).forEach(sym=>{
		  let descriptors=Object.getOwnProertyDescriptor(source,sym);
		  if(descriptors.enumerable){
		      descriptors[sym]=descriptors;
		  }
	      });
	      Object.defineProperties(target,descriptors);
	  });
	  return target;
      }

      copy=completeAssign({},obj);
      console.log(copy);
    #+END_SRC

    #+RESULTS:
    : { foo: 1, bar: 2 }
    : { foo: 1, bar: [Getter] }
    : undefined

*** Proxy
    数据拦截
    #+BEGIN_SRC js
      var obj=new Proxy({},{
	  get: function(target,propKey,receiver){
	      console.log(`getting ${propKey}!`);
	      return Reflect.get(target,propKey,receiver);
	  },
	  set: function(target,propKey,value,receiver){
	      console.log(`setting ${propKey}!`);
	      return Reflect.set(target,propKey,value,receiver);
	  }
      });

      obj.count=1
      ++obj.count
    #+END_SRC

    #+RESULTS:
    : setting count!
    : getting count!
    : setting count!
    : undefined
    
    #+BEGIN_SRC js
      var proxy=new Proxy({},{
	  get: function(target,propKey){
	      return 35;
	  }
      });

      proxy.time
      proxy.name
      proxy.title
    #+END_SRC

    #+RESULTS:
    : undefined

    #+BEGIN_SRC js
      var target={};
      var handler={};
      var proxy=new Proxy(target,handler);
      proxy.a='b';
      target.a
    #+END_SRC

    #+RESULTS:
    : undefined

    #+BEGIN_SRC js
      var proxy=new Proxy({},{
	  get: function(target,propKey){
	      return 35;
	  }
      });

      let obj=Object.create(proxy);
      obj.time
    #+END_SRC

    #+RESULTS:
    : undefined

    #+BEGIN_SRC js
      var handler={
	  get: function(target,name){
	      if(name === 'prototype'){
		  return Object.prototype;
	      }
	      return 'Hello, '+name;
	  },
	  apply: function(target,thisBinding,args){
	      return args[0];
	  },

	  construct: function(target,args){
	      return {value: args[1]};
	  }
      };

      var fproxy=new Proxy(function(x,y){
	  return {value: args[1]};
      },handler);

      fproxy(1,2)
      new fproxy(1,2)
      fproxy.prototype === Object.prototype
      fproxy.foo === "Hello, foo"
		    
    #+END_SRC

    #+RESULTS:
    : undefined

